MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS502/mcu.h
#define RPOR6 RPOR6
extern volatile uint16_t RPOR6 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR6BITS {
  union {
    struct {
      uint16_t RP44R:6;
      uint16_t :2;
      uint16_t RP45R:6;
    };
    struct {
      uint16_t RP44R0:1;
      uint16_t RP44R1:1;
      uint16_t RP44R2:1;
      uint16_t RP44R3:1;
      uint16_t RP44R4:1;
      uint16_t RP44R5:1;
      uint16_t :2;
      uint16_t RP45R0:1;
      uint16_t RP45R1:1;
      uint16_t RP45R2:1;
      uint16_t RP45R3:1;
      uint16_t RP45R4:1;
      uint16_t RP45R5:1;
    };
  };
} RPOR6BITS;
extern volatile RPOR6BITS RPOR6bits __attribute__((__sfr__));

#define RPOR7 RPOR7
extern volatile uint16_t RPOR7 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR7BITS {
  union {
    struct {
      uint16_t RP46R:6;
      uint16_t :2;
      uint16_t RP47R:6;
    };
    struct {
      uint16_t RP46R0:1;
      uint16_t RP46R1:1;
      uint16_t RP46R2:1;
      uint16_t RP46R3:1;
      uint16_t RP46R4:1;
      uint16_t RP46R5:1;
      uint16_t :2;
      uint16_t RP47R0:1;
      uint16_t RP47R1:1;
      uint16_t RP47R2:1;
      uint16_t RP47R3:1;
      uint16_t RP47R4:1;
      uint16_t RP47R5:1;
    };
  };
} RPOR7BITS;
extern volatile RPOR7BITS RPOR7bits __attribute__((__sfr__));

#define RPOR8 RPOR8
extern volatile uint16_t RPOR8 __attribute__((__sfr__));
#define RPOR9 RPOR9
extern volatile uint16_t RPOR9 __attribute__((__sfr__));
#define RPOR10 RPOR10
extern volatile uint16_t RPOR10 __attribute__((__sfr__));
#define RPOR11 RPOR11
extern volatile uint16_t RPOR11 __attribute__((__sfr__));
#define RPOR12 RPOR12
extern volatile uint16_t RPOR12 __attribute__((__sfr__));
#define RPOR13 RPOR13
extern volatile uint16_t RPOR13 __attribute__((__sfr__));
#define RPOR14 RPOR14
extern volatile uint16_t RPOR14 __attribute__((__sfr__));
#define RPOR15 RPOR15
extern volatile uint16_t RPOR15 __attribute__((__sfr__));
#define RPOR16 RPOR16
extern volatile uint16_t RPOR16 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR16BITS {
  union {
    struct {
      uint16_t RP176R:6;
      uint16_t :2;
      uint16_t RP177R:6;
    };
    struct {
      uint16_t RP176R0:1;
      uint16_t RP176R1:1;
      uint16_t RP176R2:1;
      uint16_t RP176R3:1;
      uint16_t RP176R4:1;
      uint16_t RP176R5:1;
      uint16_t :2;
      uint16_t RP177R0:1;
      uint16_t RP177R1:1;
      uint16_t RP177R2:1;
      uint16_t RP177R3:1;
      uint16_t RP177R4:1;
      uint16_t RP177R5:1;
    };
  };
} RPOR16BITS;
extern volatile RPOR16BITS RPOR16bits __attribute__((__sfr__));

#define RPOR17 RPOR17
extern volatile uint16_t RPOR17 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR17BITS {
  union {
    struct {
      uint16_t RP178R:6;
      uint16_t :2;
      uint16_t RP179R:6;
    };
    struct {
      uint16_t RP178R0:1;
      uint16_t RP178R1:1;
      uint16_t RP178R2:1;
      uint16_t RP178R3:1;
      uint16_t RP178R4:1;
      uint16_t RP178R5:1;
      uint16_t :2;
      uint16_t RP179R0:1;
      uint16_t RP179R1:1;
      uint16_t RP179R2:1;
      uint16_t RP179R3:1;
      uint16_t RP179R4:1;
      uint16_t RP179R5:1;
    };
  };
} RPOR17BITS;
extern volatile RPOR17BITS RPOR17bits __attribute__((__sfr__));

#define RPOR18 RPOR18
extern volatile uint16_t RPOR18 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR18BITS {
  union {
    struct {
      uint16_t RP180R:6;
      uint16_t :2;
      uint16_t RP181R:6;
    };
    struct {
      uint16_t RP180R0:1;
      uint16_t RP180R1:1;
      uint16_t RP180R2:1;
      uint16_t RP180R3:1;
      uint16_t RP180R4:1;
      uint16_t RP180R5:1;
      uint16_t :2;
      uint16_t RP181R0:1;
      uint16_t RP181R1:1;
      uint16_t RP181R2:1;
      uint16_t RP181R3:1;
      uint16_t RP181R4:1;
      uint16_t RP181R5:1;
    };
  };
} RPOR18BITS;
extern volatile RPOR18BITS RPOR18bits __attribute__((__sfr__));

#define RPINR0 RPINR0
extern volatile uint16_t RPINR0 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR0BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t INT1R:8;
    };
    struct {
      uint16_t :8;
      uint16_t INT1R0:1;
      uint16_t INT1R1:1;
      uint16_t INT1R2:1;
      uint16_t INT1R3:1;
      uint16_t INT1R4:1;
      uint16_t INT1R5:1;
      uint16_t INT1R6:1;
      uint16_t INT1R7:1;
    };
  };
} RPINR0BITS;
extern volatile RPINR0BITS RPINR0bits __attribute__((__sfr__));

#define RPINR1 RPINR1
extern volatile uint16_t RPINR1 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR1BITS {
  union {
    struct {
      uint16_t INT2R:8;
    };
    struct {
      uint16_t INT2R0:1;
      uint16_t INT2R1:1;
      uint16_t INT2R2:1;
      uint16_t INT2R3:1;
      uint16_t INT2R4:1;
      uint16_t INT2R5:1;
      uint16_t INT2R6:1;
      uint16_t INT2R7:1;
    };
  };
} RPINR1BITS;
extern volatile RPINR1BITS RPINR1bits __attribute__((__sfr__));

#define RPINR2 RPINR2
extern volatile uint16_t RPINR2 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR2BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t T1CKR:8;
    };
    struct {
      uint16_t :8;
      uint16_t T1CKRR:8;
    };
    struct {
      uint16_t :8;
      uint16_t T1CKRR0:1;
      uint16_t T1CKRR1:1;
      uint16_t T1CKRR2:1;
      uint16_t T1CKRR3:1;
      uint16_t T1CKRR4:1;
      uint16_t T1CKRR5:1;
      uint16_t T1CKRR6:1;
      uint16_t T1CKRR7:1;
    };
    struct {
      uint16_t :8;
      uint16_t T1CKR0:1;
      uint16_t T1CKR1:1;
      uint16_t T1CKR2:1;
      uint16_t T1CKR3:1;
      uint16_t T1CKR4:1;
      uint16_t T1CKR5:1;
      uint16_t T1CKR6:1;
      uint16_t T1CKR7:1;
    };
  };
} RPINR2BITS;
extern volatile RPINR2BITS RPINR2bits __attribute__((__sfr__));

#define RPINR3 RPINR3
extern volatile uint16_t RPINR3 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR3BITS {
  union {
    struct {
      uint16_t T2CKR:8;
      uint16_t T3CKR:8;
    };
    struct {
      uint16_t T2CKR0:1;
      uint16_t T2CKR1:1;
      uint16_t T2CKR2:1;
      uint16_t T2CKR3:1;
      uint16_t T2CKR4:1;
      uint16_t T2CKR5:1;
      uint16_t T2CKR6:1;
      uint16_t T2CKR7:1;
      uint16_t T3CKR0:1;
      uint16_t T3CKR1:1;
      uint16_t T3CKR2:1;
      uint16_t T3CKR3:1;
      uint16_t T3CKR4:1;
      uint16_t T3CKR5:1;
      uint16_t T3CKR6:1;
      uint16_t T3CKR7:1;
    };
  };
} RPINR3BITS;
extern volatile RPINR3BITS RPINR3bits __attribute__((__sfr__));

