MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS502/mcu.h
/* IPC6 */
#define _OC3IP IPC6bits.OC3IP
#define _OC4IP IPC6bits.OC4IP
#define _T4IP IPC6bits.T4IP
#define _OC3IP0 IPC6bits.OC3IP0
#define _OC3IP1 IPC6bits.OC3IP1
#define _OC3IP2 IPC6bits.OC3IP2
#define _OC4IP0 IPC6bits.OC4IP0
#define _OC4IP1 IPC6bits.OC4IP1
#define _OC4IP2 IPC6bits.OC4IP2
#define _T4IP0 IPC6bits.T4IP0
#define _T4IP1 IPC6bits.T4IP1
#define _T4IP2 IPC6bits.T4IP2

/* IPC7 */
#define _T5IP IPC7bits.T5IP
#define _INT2IP IPC7bits.INT2IP
#define _U2RXIP IPC7bits.U2RXIP
#define _U2TXIP IPC7bits.U2TXIP
#define _T5IP0 IPC7bits.T5IP0
#define _T5IP1 IPC7bits.T5IP1
#define _T5IP2 IPC7bits.T5IP2
#define _INT2IP0 IPC7bits.INT2IP0
#define _INT2IP1 IPC7bits.INT2IP1
#define _INT2IP2 IPC7bits.INT2IP2
#define _U2RXIP0 IPC7bits.U2RXIP0
#define _U2RXIP1 IPC7bits.U2RXIP1
#define _U2RXIP2 IPC7bits.U2RXIP2
#define _U2TXIP0 IPC7bits.U2TXIP0
#define _U2TXIP1 IPC7bits.U2TXIP1
#define _U2TXIP2 IPC7bits.U2TXIP2

/* IPC8 */
#define _SPI2EIP IPC8bits.SPI2EIP
#define _SPI2IP IPC8bits.SPI2IP
#define _SPI2EIP0 IPC8bits.SPI2EIP0
#define _SPI2EIP1 IPC8bits.SPI2EIP1
#define _SPI2EIP2 IPC8bits.SPI2EIP2
#define _SPI2IP0 IPC8bits.SPI2IP0
#define _SPI2IP1 IPC8bits.SPI2IP1
#define _SPI2IP2 IPC8bits.SPI2IP2

/* IPC9 */
#define _IC3IP IPC9bits.IC3IP
#define _IC4IP IPC9bits.IC4IP
#define _IC3IP0 IPC9bits.IC3IP0
#define _IC3IP1 IPC9bits.IC3IP1
#define _IC3IP2 IPC9bits.IC3IP2
#define _IC4IP0 IPC9bits.IC4IP0
#define _IC4IP1 IPC9bits.IC4IP1
#define _IC4IP2 IPC9bits.IC4IP2

/* IPC12 */
#define _SI2C2IP IPC12bits.SI2C2IP
#define _MI2C2IP IPC12bits.MI2C2IP
#define _SI2C2IP0 IPC12bits.SI2C2IP0
#define _SI2C2IP1 IPC12bits.SI2C2IP1
#define _SI2C2IP2 IPC12bits.SI2C2IP2
#define _MI2C2IP0 IPC12bits.MI2C2IP0
#define _MI2C2IP1 IPC12bits.MI2C2IP1
#define _MI2C2IP2 IPC12bits.MI2C2IP2

/* IPC13 */
#define _INT4IP IPC13bits.INT4IP
#define _INT4IP0 IPC13bits.INT4IP0
#define _INT4IP1 IPC13bits.INT4IP1
#define _INT4IP2 IPC13bits.INT4IP2

/* IPC14 */
#define _PSEMIP IPC14bits.PSEMIP
#define _PSEMIP0 IPC14bits.PSEMIP0
#define _PSEMIP1 IPC14bits.PSEMIP1
#define _PSEMIP2 IPC14bits.PSEMIP2

/* IPC16 */
#define _U1EIP IPC16bits.U1EIP
#define _U2EIP IPC16bits.U2EIP
#define _U1EIP0 IPC16bits.U1EIP0
#define _U1EIP1 IPC16bits.U1EIP1
#define _U1EIP2 IPC16bits.U1EIP2
#define _U2EIP0 IPC16bits.U2EIP0
#define _U2EIP1 IPC16bits.U2EIP1
#define _U2EIP2 IPC16bits.U2EIP2

/* IPC18 */
#define _PSESIP IPC18bits.PSESIP
#define _PSESIP0 IPC18bits.PSESIP0
#define _PSESIP1 IPC18bits.PSESIP1
#define _PSESIP2 IPC18bits.PSESIP2

/* IPC23 */
#define _PWM1IP IPC23bits.PWM1IP
#define _PWM2IP IPC23bits.PWM2IP
#define _PWM1IP0 IPC23bits.PWM1IP0
#define _PWM1IP1 IPC23bits.PWM1IP1
#define _PWM1IP2 IPC23bits.PWM1IP2
#define _PWM2IP0 IPC23bits.PWM2IP0
#define _PWM2IP1 IPC23bits.PWM2IP1
#define _PWM2IP2 IPC23bits.PWM2IP2

/* IPC24 */
#define _PWM3IP IPC24bits.PWM3IP
#define _PWM4IP IPC24bits.PWM4IP
#define _PWM5IP IPC24bits.PWM5IP
#define _PWM3IP0 IPC24bits.PWM3IP0
#define _PWM3IP1 IPC24bits.PWM3IP1
#define _PWM3IP2 IPC24bits.PWM3IP2
#define _PWM4IP0 IPC24bits.PWM4IP0
#define _PWM4IP1 IPC24bits.PWM4IP1
#define _PWM4IP2 IPC24bits.PWM4IP2
#define _PWM5IP0 IPC24bits.PWM5IP0
#define _PWM5IP1 IPC24bits.PWM5IP1
#define _PWM5IP2 IPC24bits.PWM5IP2

/* IPC25 */
#define _AC2IP IPC25bits.AC2IP
#define _AC2IP0 IPC25bits.AC2IP0
#define _AC2IP1 IPC25bits.AC2IP1
#define _AC2IP2 IPC25bits.AC2IP2

/* IPC26 */
#define _AC3IP IPC26bits.AC3IP
#define _AC4IP IPC26bits.AC4IP
#define _AC3IP0 IPC26bits.AC3IP0
#define _AC3IP1 IPC26bits.AC3IP1
#define _AC3IP2 IPC26bits.AC3IP2
#define _AC4IP0 IPC26bits.AC4IP0
#define _AC4IP1 IPC26bits.AC4IP1
#define _AC4IP2 IPC26bits.AC4IP2

/* IPC27 */
#define _ADCAN0IP IPC27bits.ADCAN0IP
#define _ADCAN1IP IPC27bits.ADCAN1IP
#define _ADCAN0IP0 IPC27bits.ADCAN0IP0
#define _ADCAN0IP1 IPC27bits.ADCAN0IP1
#define _ADCAN0IP2 IPC27bits.ADCAN0IP2
#define _ADCAN1IP0 IPC27bits.ADCAN1IP0
#define _ADCAN1IP1 IPC27bits.ADCAN1IP1
#define _ADCAN1IP2 IPC27bits.ADCAN1IP2

/* IPC28 */
#define _ADCAN2IP IPC28bits.ADCAN2IP
#define _ADCAN3IP IPC28bits.ADCAN3IP
#define _ADCAN4IP IPC28bits.ADCAN4IP
#define _ADCAN5IP IPC28bits.ADCAN5IP
#define _ADCAN2IP0 IPC28bits.ADCAN2IP0
#define _ADCAN2IP1 IPC28bits.ADCAN2IP1
#define _ADCAN2IP2 IPC28bits.ADCAN2IP2
#define _ADCAN3IP0 IPC28bits.ADCAN3IP0
#define _ADCAN3IP1 IPC28bits.ADCAN3IP1
#define _ADCAN3IP2 IPC28bits.ADCAN3IP2
#define _ADCAN4IP0 IPC28bits.ADCAN4IP0
#define _ADCAN4IP1 IPC28bits.ADCAN4IP1
#define _ADCAN4IP2 IPC28bits.ADCAN4IP2
#define _ADCAN5IP0 IPC28bits.ADCAN5IP0
#define _ADCAN5IP1 IPC28bits.ADCAN5IP1
#define _ADCAN5IP2 IPC28bits.ADCAN5IP2

/* IPC29 */
#define _ADCAN6IP IPC29bits.ADCAN6IP
#define _ADCAN7IP IPC29bits.ADCAN7IP
#define _ADCAN6IP0 IPC29bits.ADCAN6IP0
#define _ADCAN6IP1 IPC29bits.ADCAN6IP1
#define _ADCAN6IP2 IPC29bits.ADCAN6IP2
#define _ADCAN7IP0 IPC29bits.ADCAN7IP0
#define _ADCAN7IP1 IPC29bits.ADCAN7IP1
#define _ADCAN7IP2 IPC29bits.ADCAN7IP2

/* IPC35 */
#define _ICDIP IPC35bits.ICDIP
#define _JTAGIP IPC35bits.JTAGIP
#define _ICDIP0 IPC35bits.ICDIP0
#define _ICDIP1 IPC35bits.ICDIP1
#define _ICDIP2 IPC35bits.ICDIP2
#define _JTAGIP0 IPC35bits.JTAGIP0
#define _JTAGIP1 IPC35bits.JTAGIP1
#define _JTAGIP2 IPC35bits.JTAGIP2

/* IPC40 */
#define _ADCAN18IP IPC40bits.ADCAN18IP
#define _ADCAN19IP IPC40bits.ADCAN19IP
#define _ADCAN20IP IPC40bits.ADCAN20IP
#define _ADCAN18IP0 IPC40bits.ADCAN18IP0
#define _ADCAN18IP1 IPC40bits.ADCAN18IP1
#define _ADCAN18IP2 IPC40bits.ADCAN18IP2
#define _ADCAN19IP0 IPC40bits.ADCAN19IP0
#define _ADCAN19IP1 IPC40bits.ADCAN19IP1
#define _ADCAN19IP2 IPC40bits.ADCAN19IP2
#define _ADCAN20IP0 IPC40bits.ADCAN20IP0
#define _ADCAN20IP1 IPC40bits.ADCAN20IP1
#define _ADCAN20IP2 IPC40bits.ADCAN20IP2

/* IPC41 */
#define _ADCAN21IP IPC41bits.ADCAN21IP
#define _ADCAN21IP0 IPC41bits.ADCAN21IP0
#define _ADCAN21IP1 IPC41bits.ADCAN21IP1
#define _ADCAN21IP2 IPC41bits.ADCAN21IP2

/* IPC43 */
#define _I2C1BCIP IPC43bits.I2C1BCIP
#define _I2C2BCIP IPC43bits.I2C2BCIP
#define _I2C1BCIP0 IPC43bits.I2C1BCIP0
#define _I2C1BCIP1 IPC43bits.I2C1BCIP1
#define _I2C1BCIP2 IPC43bits.I2C1BCIP2
#define _I2C2BCIP0 IPC43bits.I2C2BCIP0
#define _I2C2BCIP1 IPC43bits.I2C2BCIP1
#define _I2C2BCIP2 IPC43bits.I2C2BCIP2

/* IPC44 */
#define _ADCMP0IP IPC44bits.ADCMP0IP
#define _ADCMP1IP IPC44bits.ADCMP1IP
#define _ADFLTR0IP IPC44bits.ADFLTR0IP
#define _ADCMP0IP0 IPC44bits.ADCMP0IP0
#define _ADCMP0IP1 IPC44bits.ADCMP0IP1
#define _ADCMP0IP2 IPC44bits.ADCMP0IP2
#define _ADCMP1IP0 IPC44bits.ADCMP1IP0
#define _ADCMP1IP1 IPC44bits.ADCMP1IP1
#define _ADCMP1IP2 IPC44bits.ADCMP1IP2
#define _ADFLTR0IP0 IPC44bits.ADFLTR0IP0
#define _ADFLTR0IP1 IPC44bits.ADFLTR0IP1
#define _ADFLTR0IP2 IPC44bits.ADFLTR0IP2

