MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS502/mcu.h
#define _RPINR18_U1CTSR5_POSITION                0x0000000D
#define _RPINR18_U1CTSR5_MASK                    0x00002000
#define _RPINR18_U1CTSR5_LENGTH                  0x00000001

#define _RPINR18_U1CTSR6_POSITION                0x0000000E
#define _RPINR18_U1CTSR6_MASK                    0x00004000
#define _RPINR18_U1CTSR6_LENGTH                  0x00000001

#define _RPINR18_U1CTSR7_POSITION                0x0000000F
#define _RPINR18_U1CTSR7_MASK                    0x00008000
#define _RPINR18_U1CTSR7_LENGTH                  0x00000001

#define _RPINR19_U2RXR_POSITION                  0x00000000
#define _RPINR19_U2RXR_MASK                      0x000000FF
#define _RPINR19_U2RXR_LENGTH                    0x00000008

#define _RPINR19_U2CTSR_POSITION                 0x00000008
#define _RPINR19_U2CTSR_MASK                     0x0000FF00
#define _RPINR19_U2CTSR_LENGTH                   0x00000008

#define _RPINR19_U2RXR0_POSITION                 0x00000000
#define _RPINR19_U2RXR0_MASK                     0x00000001
#define _RPINR19_U2RXR0_LENGTH                   0x00000001

#define _RPINR19_U2RXR1_POSITION                 0x00000001
#define _RPINR19_U2RXR1_MASK                     0x00000002
#define _RPINR19_U2RXR1_LENGTH                   0x00000001

#define _RPINR19_U2RXR2_POSITION                 0x00000002
#define _RPINR19_U2RXR2_MASK                     0x00000004
#define _RPINR19_U2RXR2_LENGTH                   0x00000001

#define _RPINR19_U2RXR3_POSITION                 0x00000003
#define _RPINR19_U2RXR3_MASK                     0x00000008
#define _RPINR19_U2RXR3_LENGTH                   0x00000001

#define _RPINR19_U2RXR4_POSITION                 0x00000004
#define _RPINR19_U2RXR4_MASK                     0x00000010
#define _RPINR19_U2RXR4_LENGTH                   0x00000001

#define _RPINR19_U2RXR5_POSITION                 0x00000005
#define _RPINR19_U2RXR5_MASK                     0x00000020
#define _RPINR19_U2RXR5_LENGTH                   0x00000001

#define _RPINR19_U2RXR6_POSITION                 0x00000006
#define _RPINR19_U2RXR6_MASK                     0x00000040
#define _RPINR19_U2RXR6_LENGTH                   0x00000001

#define _RPINR19_U2RXR7_POSITION                 0x00000007
#define _RPINR19_U2RXR7_MASK                     0x00000080
#define _RPINR19_U2RXR7_LENGTH                   0x00000001

#define _RPINR19_U2CTSR0_POSITION                0x00000008
#define _RPINR19_U2CTSR0_MASK                    0x00000100
#define _RPINR19_U2CTSR0_LENGTH                  0x00000001

#define _RPINR19_U2CTSR1_POSITION                0x00000009
#define _RPINR19_U2CTSR1_MASK                    0x00000200
#define _RPINR19_U2CTSR1_LENGTH                  0x00000001

#define _RPINR19_U2CTSR2_POSITION                0x0000000A
#define _RPINR19_U2CTSR2_MASK                    0x00000400
#define _RPINR19_U2CTSR2_LENGTH                  0x00000001

#define _RPINR19_U2CTSR3_POSITION                0x0000000B
#define _RPINR19_U2CTSR3_MASK                    0x00000800
#define _RPINR19_U2CTSR3_LENGTH                  0x00000001

#define _RPINR19_U2CTSR4_POSITION                0x0000000C
#define _RPINR19_U2CTSR4_MASK                    0x00001000
#define _RPINR19_U2CTSR4_LENGTH                  0x00000001

#define _RPINR19_U2CTSR5_POSITION                0x0000000D
#define _RPINR19_U2CTSR5_MASK                    0x00002000
#define _RPINR19_U2CTSR5_LENGTH                  0x00000001

#define _RPINR19_U2CTSR6_POSITION                0x0000000E
#define _RPINR19_U2CTSR6_MASK                    0x00004000
#define _RPINR19_U2CTSR6_LENGTH                  0x00000001

#define _RPINR19_U2CTSR7_POSITION                0x0000000F
#define _RPINR19_U2CTSR7_MASK                    0x00008000
#define _RPINR19_U2CTSR7_LENGTH                  0x00000001

#define _RPINR20_SDI1R_POSITION                  0x00000000
#define _RPINR20_SDI1R_MASK                      0x000000FF
#define _RPINR20_SDI1R_LENGTH                    0x00000008

#define _RPINR20_SCK1INR_POSITION                0x00000008
#define _RPINR20_SCK1INR_MASK                    0x0000FF00
#define _RPINR20_SCK1INR_LENGTH                  0x00000008

#define _RPINR20_SDI1R0_POSITION                 0x00000000
#define _RPINR20_SDI1R0_MASK                     0x00000001
#define _RPINR20_SDI1R0_LENGTH                   0x00000001

#define _RPINR20_SDI1R1_POSITION                 0x00000001
#define _RPINR20_SDI1R1_MASK                     0x00000002
#define _RPINR20_SDI1R1_LENGTH                   0x00000001

#define _RPINR20_SDI1R2_POSITION                 0x00000002
#define _RPINR20_SDI1R2_MASK                     0x00000004
#define _RPINR20_SDI1R2_LENGTH                   0x00000001

#define _RPINR20_SDI1R3_POSITION                 0x00000003
#define _RPINR20_SDI1R3_MASK                     0x00000008
#define _RPINR20_SDI1R3_LENGTH                   0x00000001

#define _RPINR20_SDI1R4_POSITION                 0x00000004
#define _RPINR20_SDI1R4_MASK                     0x00000010
#define _RPINR20_SDI1R4_LENGTH                   0x00000001

#define _RPINR20_SDI1R5_POSITION                 0x00000005
#define _RPINR20_SDI1R5_MASK                     0x00000020
#define _RPINR20_SDI1R5_LENGTH                   0x00000001

#define _RPINR20_SDI1R6_POSITION                 0x00000006
#define _RPINR20_SDI1R6_MASK                     0x00000040
#define _RPINR20_SDI1R6_LENGTH                   0x00000001

#define _RPINR20_SDI1R7_POSITION                 0x00000007
#define _RPINR20_SDI1R7_MASK                     0x00000080
#define _RPINR20_SDI1R7_LENGTH                   0x00000001

#define _RPINR20_SCK1INR0_POSITION               0x00000008
#define _RPINR20_SCK1INR0_MASK                   0x00000100
#define _RPINR20_SCK1INR0_LENGTH                 0x00000001

#define _RPINR20_SCK1INR1_POSITION               0x00000009
#define _RPINR20_SCK1INR1_MASK                   0x00000200
#define _RPINR20_SCK1INR1_LENGTH                 0x00000001

#define _RPINR20_SCK1INR2_POSITION               0x0000000A
#define _RPINR20_SCK1INR2_MASK                   0x00000400
#define _RPINR20_SCK1INR2_LENGTH                 0x00000001

#define _RPINR20_SCK1INR3_POSITION               0x0000000B
#define _RPINR20_SCK1INR3_MASK                   0x00000800
#define _RPINR20_SCK1INR3_LENGTH                 0x00000001

#define _RPINR20_SCK1INR4_POSITION               0x0000000C
#define _RPINR20_SCK1INR4_MASK                   0x00001000
#define _RPINR20_SCK1INR4_LENGTH                 0x00000001

#define _RPINR20_SCK1INR5_POSITION               0x0000000D
#define _RPINR20_SCK1INR5_MASK                   0x00002000
#define _RPINR20_SCK1INR5_LENGTH                 0x00000001

#define _RPINR20_SCK1INR6_POSITION               0x0000000E
#define _RPINR20_SCK1INR6_MASK                   0x00004000
#define _RPINR20_SCK1INR6_LENGTH                 0x00000001

